Tekla Open API Reference for Tekla Structures 2025
MeshSelectionForm Class
 The MeshSelectionForm class represents a dialog to select meshes using the mesh catalog.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.Form
 Tekla.Structures.Dialog.FormBase
 Tekla.Structures.Dialog.ApplicationFormBase
 Tekla.Structures.Dialog.UIControls.MeshSelectionForm
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class MeshSelectionForm : ApplicationFormBase
Public Class MeshSelectionForm
	Inherits ApplicationFormBase
The MeshSelectionForm type exposes the following members.
Constructors
Name | Description
MeshSelectionForm(List<MeshItem>)
 Creates a new instance of the MeshSelectionForm.
MeshSelectionForm(List<MeshItem>, String, String)
 Creates a new instance of the MeshSelectionForm and will select in the tree the mesh that contains the given parameters (if possible).
Top
Properties
Name | Description
Localization
 The localization instance for the dialog. Each dialog has its own localization instance that has read the localization files needed for that dialog.
 (Inherited from FormBase.)
SelectedMeshGrade
 The selected mesh grade.
SelectedMeshName
 The selected mesh name.
Top
Methods
Name | Description
ApplyValues
 Loads the dialog values from a file and performs Apply() on the loaded values. To match the files to a certain dialog, the file suffix is set as the dialog type's name.
 (Inherited from FormBase.)
GetConnectionStatus
 Returns true if a proper connection to the Tekla Structures process has been established. Currently, there's no way to re-establish the connection.
 (Inherited from FormBase.)
InitializeForm
 Prepares the data storage for the dialog and scans through the fields.
 (Inherited from FormBase.)
LoadValues
 Loads the dialog values from a file. To match the files to a certain dialog, the file suffix is set as the dialog type's name.
 (Inherited from FormBase.)
ModifyValues
 Loads the dialog values from a file and performs Modify() on the loaded values. To match the files to a certain dialog, the file suffix is set as the dialog type's name.
 (Inherited from FormBase.)
SaveValues
 Serializes the dialog values to an xml file.
 (Inherited from FormBase.)
SetAttributeValue
 Sets a value for the given control. When the dialog is not shown, setting a property directly for a control (such as textBox1.Text = "text") will not work for controls that have a Tekla Structures AttributeTypeName set. This method is going to have to be used to set the value.
 (Inherited from FormBase.)
ShowForm
 Displays the form.
 (Inherited from FormBase.)
UpdateValues |  Obsolete.
 Rereads and updates all the field values on the form.
 (Inherited from FormBase.)
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace